# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 5
cols = tuple( 'ABCDE' )
df = pd. DataFrame(np. random. randint(1, 10, size=(n_rows, n_cols)),
columns=cols)
df

   A  B  C  D  E
0  8  9  5  4  1
1  9  4  9  4  2
2  3  1  8  3  1
3  9  6  8  7  4
4  8  4  6  2  1

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [13]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  8  9     5  4  1
1  9  4     9  4  2
2  3  1     8  3  1
3  9  6     8  7  4
4  8  4     6  2  1

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [15]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     8       9  5     4  1
1     9       4  9     4  2
2     3       1  8     3  1
3     9       6  8     7  4
4     8       4  6     2  1